;エキスパートアドバイザーの単一テスト: OB_BOS_Strategy_EA, XAUUSD M5, 全ティック, 2025.09.01 - 2025.11.01
[Tester]
Expert=OB_BOS_Strategy_EA.ex5
Symbol=XAUUSD
Period=M5
Optimization=0
Model=0
FromDate=2025.09.01
ToDate=2025.11.01
ForwardMode=0
Deposit=100000
Currency=JPY
ProfitInPips=1
Leverage=500
ExecutionMode=0
OptimizationCriterion=0
Visual=0
[TesterInputs]
; === 💰 リスク管理 (保守的) ===
RiskPercent=2||1.0||0.100000||10.000000||Y
MaxOrdersPerDirection=1||1||1||10||Y
MagicNumber=123456||123456||1||1234560||Y
TradeComment=OB_BOS
; === 📊 トレンドフィルター (厳格化) ===
TrendEMA_Period=50||50||1||500||Y
TrendMinDistance=50.0||50.0||5.000000||500.000000||N
; === 📍 BOS設定 (厳選) ===
BOS_LookbackBars=30||30||1||300||Y
BOS_MinBreakDistance=20.0||20.0||2.000000||200.000000||N
; === ⏱ OB有効期限 (短め) ===
OB_ExpiryMode=1||1||1||10||Y
OB_ExpiryBars=50||50||1||500||Y
OB_ExpiryMinutes=120||120||1||1200||Y
; === 🎯 SL/TP設定 (安全寄り) ===
SLTP_Mode=1||1||1||10||Y
ATR_Period=14||14||1||140||Y
SL_ATR_Mult=1.2||1.2||0.120000||12.000000||Y
TP_ATR_Mult=2.2||2.2||0.220000||22.000000||Y
OB_RR_TP_Mult=2.0||2.0||0.200000||20.000000||Y
MinRiskReward=1.2||1.2||0.120000||12.000000||N
; === 🛡 フィルター (厳格化) ===
MaxSpreadPoints=30||30||1||300||Y
UseTradeTimeFilter=false||false||0||true||Y
TradeStartHour=0||0||1||10||Y
TradeEndHour=23||23||1||230||Y
UseConfirmationCandle=true||false||0||true||N
; === 📈 追加フィルター (新規) ===
CheckVolatility=true||false||0||true||N
MinATRValue=3.0||3.0||0.300000||30.000000||N
MaxATRValue=20.0||20.0||2.000000||200.000000||N
